import numpy as np
import random as rnd

"""
1. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти наибольший элемент столбца матрицы A,
для которого сумма абсолютных значений элементов максимальна.
"""
N = 3
print("N = ", N)
M = 4
print("M = ", M)

B = (np.array([rnd.random() for i in range(N*M)]).reshape(N,M) * 100).astype('int') - 50
print("B\n", B)

J_SUM = np.sum(np.abs(B), 0)
print("Суммы абсолютых значений в столбцах", J_SUM)
print("Решение = ", np.max(B, 0)[np.argmax(J_SUM)])

"""
2. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти наибольшее значение среди средних
значений для каждой строки матрицы.
"""

"""
3. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти наименьший элемент столбца матрицы A,
для которого сумма абсолютных значений элементов максимальна.

4. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти наименьшее значение среди средних
значений для каждой строки матрицы.

5. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Определить средние значения по всем строкам и
столбцам матрицы. Результат оформить в виде матрицы из N + 1 строк и M

6. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти сумму элементов всей матрицы.
Определить, какую долю в этой сумме составляет сумма элементов каждого
столбца. Результат оформить в виде матрицы из N + 1 строк и M столбцов.

7. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти сумму элементов всей матрицы.
Определить, какую долю в этой сумме составляет сумма элементов каждой
строки. Результат оформить в виде матрицы из N строк и M+1 столбцов.

8. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Определить, сколько отрицательных элементов
содержится в каждом столбце и в каждой строке матрицы. Результат
оформить в виде матрицы из N + 1 строк и M + 1 столбцов.

9. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Определить, сколько нулевых элементов
содержится в верхних L строках матрицы и в левых К столбцах матрицы.

10. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Перемножить элементы каждого столбца матрицы
с соответствующими элементами K-го столбца.

11. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Просуммировать элементы каждой строки
матрицы с соответствующими элементами L-й строки.

12. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Разделить элементы каждой строки на элемент
этой строки с наибольшим значением.

13. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Разделить элементы каждого столбца матрицы на
элемент этого столбца с наибольшим значением.

14. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Разделить элементы матрицы на элемент матрицы
с наибольшим значением.

15. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Все элементы имеют целый тип. Дано целое число
H. Определить, какие столбцы имеют хотя бы одно такое число, а какие не
имеют.

16. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Исключить из матрицы строку с номером L.
Сомкнуть строки матрицы.

17. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Добавить к матрице строку и вставить ее под
номером L.

18. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Найти сумму элементов, стоящих на главной
диагонали, и сумму элементов, стоящих на побочной диагонали (элементы
главной диагонали имеют индексы от [0,0] до [N,N], а элементы побочной
диагонали — от [N,0] до [0,N]).

19. Создать квадратную матрицу A, имеющую N строк и N столбцов со
случайными элементами. Определить сумму элементов, расположенных
параллельно главной диагонали (ближайшие к главной). Элементы главной
диагонали имеют индексы от [0,0] до [N,N].

20. Создать квадратную матрицу A, имеющую N строк и N столбцов со
случайными элементами. Определить произведение элементов,
расположенных параллельно побочной диагонали (ближайшие к побочной).
Элементы побочной диагонали имеют индексы от [N,0] до [0,N].

21. Создать квадратную матрицу A, имеющую N строк и N столбцов со
случайными элементами. Каждой паре элементов, симметричных
относительно главной диагонали (ближайшие к главной), присвоить
значения, равные полусумме этих симметричных значений (элементы
главной диагонали имеют индексы от [0,0] до [N,N]).

22. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Исходная матрица состоит из нулей и единиц.
Добавить к матрице еще один столбец, каждый элемент которого делает
количество единиц в каждой строке чётным.

23. Создать квадратную матрицу A, имеющую N строк и N столбцов со
случайными элементами. Найти сумму элементов, расположенных выше
главной диагонали, и произведение элементов, расположенных выше
побочной диагонали (элементы главной диагонали имеют индексы от [0,0]
до [N,N], а элементы побочной диагонали — от [N,0] до [0,N]).

24. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Дан номер строки L и номер столбца K, при
помощи которых исходная матрица разбивается на четыре части. Найти
сумму элементов каждой части.

25. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Определить, сколько нулевых элементов
содержится в каждом столбце и в каждой строке матрицы. Результат
оформить в виде матрицы из N + 1 строк и M + 1 столбцов.

26. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Дан номер строки L и номер столбца K, при
помощи которых исходная матрица разбивается на четыре части. Найти
среднее арифметическое элементов каждой части.

27. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Все элементы имеют целый тип. Дано целое число
H. Определить, какие строки имеют хотя бы одно такое число, а какие не
имеют.

28. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Исключить из матрицы столбец с номером K.
Сомкнуть столбцы матрицы.

29. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Добавить к матрице столбец чисел и вставить его
под номером K.

30. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Добавить к элементам каждого столбца такой
новый элемент, чтобы сумма положительных элементов стала бы равна
модулю суммы отрицательных элементов. Результат оформить в виде
матрицы из N + 1 строк и M столбцов.

31. Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
случайными элементами. Добавить к элементам каждой строки такой новый
элемент, чтобы сумма положительных элементов стала бы равна модулю
суммы отрицательных элементов. Результат оформить в виде матрицы из N
строк и M + 1 столбцов
"""


